Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
        { /* Configure Message RAM Sections */
            constexpr DL_MCAN_MsgRAMConfigParams  ramConfig = {
                    .flssa                = 0,  /* Standard ID Filter List Start Address. */
                    .lss                  = 2,  /* List Size: Standard ID. */
                    .flesa                = 0,  /* Extended ID Filter List Start Address. */
                    .lse                  = 0,  /* List Size: Extended ID. */
                    .txStartAddr          = 148, /* Tx Buffers Start Address. */
                    .txBufNum             = 2,  /* Number of Dedicated Transmit Buffers. */
                    .txFIFOSize           = 19, /* Tx Buffer Element Size. */
                    .txBufMode            = 0,
                    .txBufElemSize        = DL_MCAN_ELEM_SIZE_64BYTES,
                    .txEventFIFOStartAddr = 164,/* Tx Event FIFO Start Address. */
                    .txEventFIFOSize      = 2,  /* Event FIFO Size. */
                    .txEventFIFOWaterMark = 0,  /* Level for Tx Event FIFO watermark interrupt. */
                    .rxFIFO0startAddr     = 172,  /* Rx FIFO0 Start Address. */
                    .rxFIFO0size          = 3,  /* Number of Rx FIFO elements. */
                    .rxFIFO0waterMark     = 0,  /* Rx FIFO0 Watermark. */
                    .rxFIFO0OpMode        = 0,
                    .rxFIFO1startAddr     = 192,  /* Rx FIFO1 Start Address. */
                    .rxFIFO1size          = 2,  /* Number of Rx FIFO elements. */
                    .rxFIFO1waterMark     = 3,  /* Level for Rx FIFO 1 watermark interrupt. */
                    .rxFIFO1OpMode        = 0,  /* FIFO blocking mode. */
                    .rxBufStartAddr       = 208,  /* Rx Buffer Start Address. */
                    .rxBufElemSize        = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx Buffer Element Size. */
                    .rxFIFO0ElemSize      = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx FIFO0 Element Size. */
                    .rxFIFO1ElemSize      = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx FIFO1 Element Size. */
                };
            DL_MCAN_msgRAMConfig(CANFD0, &ramConfig);
        }

//        {
//            constexpr DL_MCAN_StdMsgIDFilterElement filtere = {
//                   .sfid2   = 3 << 18,
//                   .sfid1   = 3,
//                   .sfec    = 0b001,
//                   .sft     = 0b01,
//                };
//            DL_MCAN_addStdMsgIDFilter(CANFD0, 0, &filtere);
//        }

        /* Set Extended ID Mask. */
        // is ANDed with 29b message id of frame
        DL_MCAN_setExtIDAndMask(CANFD0, 0x1FFFFFFF);

        /* Take MCAN out of the SW initialization mode */
        DL_MCAN_setOpMode(CANFD0, DL_MCAN_OPERATION_MODE_NORMAL);
        while(DL_MCAN_OPERATION_MODE_NORMAL != DL_MCAN_getOpMode(CANFD0))
            ;
    }
    #endif

}

inline bool System::Lockable::takeResource(TickType_t timeout) {
    return pdTRUE == xSemaphoreTakeRecursive(semph, timeout);
}

inline void System::Lockable::releaseResource() {
    xSemaphoreGiveRecursive(semph);
}

void System::UART::UART::setBaudTarget(uint32_t target_baud, uint32_t clk) {
    // i remember seeing there was some function in DL that did exactly the same thing.
    // I cant find it anymore :(

    //TODO pg1351 https://www.ti.com/lit/ug/slau846b/slau846b.pdf?ts=1749245238762&ref_url=https%253A%252F%252Fwww.ti.com%252Fproduct%252FMSPM0G3507
    // 115200 baud
    uint32_t nume = clk;
    uint32_t deno = target_baud;

    switch(DL_UART_getOversampling(reg)){
        default:            break; // should never reach this, your cooked, maybe screwed up the initialization or something
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_3X:
            deno *= 3;      break;
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_8X:
            deno *= 8;      break;
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_16X:
            deno *= 16;     break;
    };

    int32_t integer, fractional;
    integer = nume / deno;
    fractional = ( (nume * 64) + 1 ) / deno;

    DL_UART_setBaudRateDivisor(reg, integer, fractional);

    return;
}

/**
 * usage example
 *      System::UART::partialInit(UART0);
 *      DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM21, IOMUX_PINCM21_PF_UART0_TX); // PA10
 *      DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM22, IOMUX_PINCM22_PF_UART0_RX); // PA11
 *
 *      setBaudTarget(UART0, 115200);
 *      DL_UART_enable(UART0);
 */
void System::UART::UART::partialInit() {
    DL_UART_disable(reg);
    DL_UART_disablePower(reg);
    DL_UART_reset(reg);
    DL_UART_enablePower(reg);

    constexpr DL_UART_ClockConfig config_uart_clk = {
            .clockSel   = DL_UART_CLOCK::DL_UART_CLOCK_MFCLK,
            .divideRatio= DL_UART_CLOCK_DIVIDE_RATIO::DL_UART_CLOCK_DIVIDE_RATIO_1,
        };
    constexpr DL_UART_Config config_uart = {
            .mode        = DL_UART_MODE::DL_UART_MAIN_MODE_NORMAL,
            .direction   = DL_UART_DIRECTION::DL_UART_MAIN_DIRECTION_TX_RX,
            .flowControl = DL_UART_FLOW_CONTROL::DL_UART_MAIN_FLOW_CONTROL_NONE,
            .parity      = DL_UART_PARITY::DL_UART_MAIN_PARITY_NONE,
            .wordLength  = DL_UART_WORD_LENGTH::DL_UART_MAIN_WORD_LENGTH_8_BITS,
            .stopBits    = DL_UART_STOP_BITS::DL_UART_MAIN_STOP_BITS_ONE
        };
    DL_UART_setClockConfig(reg, &config_uart_clk);
    DL_UART_init(reg, &config_uart);

    DL_UART_setOversampling(reg, DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_16X);

    DL_UART_enableFIFOs(reg); // not required but very useful
}

void System::FailHard(const char *str) {
    taskDISABLE_INTERRUPTS();

    static uint32_t count = 0;
    while(1) {
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIERROR "fatal error "));
        System::uart_ui.putu32d(count);
        System::uart_ui.nputs(ARRANDN(" : " CLIRESET));
        System::uart_ui.nputs(str, MAX_STR_ERROR_LEN);

        delay_cycles(System::CLK::CPUCLK * 10);
        count++;
    }

    // this will effectively stun lock the device and make the debugger throw a fit
//    DL_SYSCTL_resetDevice(DL_SYSCTL_RESET_CAUSE_POR_SW_TRIGGERED);
}

void System::UART::UART::nputs(const char *str, uint32_t n) {
    for(uint32_t i = 0; (i < n) && (str[i] != '\0'); i++){
        DL_UART_transmitDataBlocking(reg, str[i]);
    }
}

void System::UART::UART::ngets(char *str, uint32_t n) {
    for(uint32_t i = 0; i < n; i++){
        char c = DL_UART_receiveDataBlocking(reg);

