Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
    }while (true);

    DL_I2C_setTimerPeriod(reg, effective_clk / (target * 10) - 1);
}

void System::I2C::I2C::_irq() {
    switch(DL_I2C_getPendingInterrupt(reg)){
        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_RXFIFO_TRIGGER:
            uart_ui.nputs(ARRANDN(" R "));
            while(!DL_I2C_isControllerRXFIFOEmpty(reg)){
                if(_trxBuffer.nxt_index < _trxBuffer.data_length){
                    _trxBuffer.data[_trxBuffer.nxt_index++] = DL_I2C_receiveControllerData(reg);
                } else {
                    // ignore and flush
                    DL_I2C_receiveControllerData(reg);
                }
            }
            break;

        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER:
            uart_ui.nputs(ARRANDN(" T "));
            // fill TX fifo
            if(_trxBuffer.nxt_index < _trxBuffer.data_length){
                _trxBuffer.nxt_index += DL_I2C_fillControllerTXFIFO(
                        reg,
                        ((uint8_t *)_trxBuffer.data) + _trxBuffer.nxt_index,
                        _trxBuffer.data_length - _trxBuffer.nxt_index
                    );
            }
            break;

        case DL_I2C_IIDX::DL_I2C_IIDX_TIMEOUT_A:
        case DL_I2C_IIDX::DL_I2C_IIDX_TIMEOUT_B:
            uart_ui.nputs(ARRANDN(" O "));
            _trxBuffer.data_length = 0;
            _trxBuffer.error = ERROR::TIMEOUT;
            break;

        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_NACK:
            uart_ui.nputs(ARRANDN(" N "));
            _trxBuffer.data_length = 0;
            _trxBuffer.error = ERROR::NACK;
            break;

        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_TX_DONE:
        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_RX_DONE:
            uart_ui.nputs(ARRANDN(" D "));
            _trxBuffer.data_length = 0;
            _trxBuffer.error = ERROR::NONE;
            break;

        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_STOP:
            uart_ui.nputs(ARRANDN(" E "));
            switch(_trxBuffer.error){
                case ERROR::IN_USE:
                    _trxBuffer.error = ERROR::NONE;
                    break;

                default: break;
            }
            break;
        case DL_I2C_IIDX::DL_I2C_IIDX_CONTROLLER_START:
            uart_ui.nputs(ARRANDN(" B "));
            _trxBuffer.error = ERROR::IN_USE;
            break;

        default:
            break;
    };
}

void System::I2C::I2C::tx(uint8_t addr, void * data, buffersize_t size) {
    while (isBusy())
        {}

    DL_I2C_flushControllerTXFIFO(reg);

    _trxBuffer.data         = (uint8_t *)data;
    _trxBuffer.data_length  = size;
    _trxBuffer.error        = ERROR::IN_USE;
    _trxBuffer.nxt_index    = DL_I2C_fillControllerTXFIFO(reg, _trxBuffer.data, _trxBuffer.data_length);

    DL_I2C_startControllerTransfer(
            reg,
            addr,
            DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_TX,
            _trxBuffer.data_length
        );
}

void System::I2C::I2C::rx(uint8_t addr, void * data, buffersize_t size) {
    while(isBusy())
        {}

    DL_I2C_flushControllerTXFIFO(reg);

    _trxBuffer.data         = (uint8_t *)data;
    _trxBuffer.data_length  = size;
    _trxBuffer.error        = ERROR::IN_USE;
    _trxBuffer.nxt_index    = 0;

    DL_I2C_startControllerTransfer(
            reg,
            addr,
            DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_RX,
            _trxBuffer.data_length
        );
}

bool System::I2C::I2C::tx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    tx(addr, data, size);
    while(isBusy());
    return _trxBuffer.error == ERROR::NONE;
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    rx(addr, data, size);
    while(isBusy());
    return _trxBuffer.error == ERROR::NONE;
}


/*--- Peripheral IRQ assignment --------------------------------------------------------*/
/* most peripherals don't need a IRQ
 */

#ifdef PROJECT_ENABLE_I2C0
    extern "C" void I2C0_IRQHandler(void){ System::i2c0._irq(); }
#endif
#ifdef PROJECT_ENABLE_I2C1
    extern "C" void I2C1_IRQHandler(void){ System::i2c1._irq(); }
#endif
#ifdef PROJECT_ENABLE_SPI0
    extern "C" void SPI0_IRQHandler(void){ System::spi0._irq(); }
#endif
#ifdef PROJECT_ENABLE_SPI1
    extern "C" void SPI1_IRQHandler(void){ System::spi1._irq(); }
#endif


    // for ease of debugging. delete if needed
    /*
    extern "C" void NMI_Handler(void)
    { while(1){} }
    extern "C" void HardFault_Handler(void) // if this is giving u a problem check if your using IRQ safe funcitons in your IRQ
    { while(1){} }
    extern "C" void GROUP0_IRQHandler(void)
    { while(1){} }
    extern "C" void GROUP1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG8_IRQHandler(void)
    { while(1){} }
    extern "C" void UART3_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC0_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC1_IRQHandler(void)
    { while(1){} }
    extern "C" void CANFD0_IRQHandler(void)
    { while(1){} }
    extern "C" void DAC0_IRQHandler(void)
    { while(1){} }
    extern "C" void UART1_IRQHandler(void)
    { while(1){} }
    extern "C" void UART2_IRQHandler(void)
    { while(1){} }
    extern "C" void UART0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG6_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG7_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG12_IRQHandler(void)
    { while(1){} }
    extern "C" void I2C0_IRQHandler(void)
    { while(1){} }
    extern "C" void AES_IRQHandler(void)
    { while(1){} }
    extern "C" void RTC_IRQHandler(void)
    { while(1){} }
    extern "C" void DMA_IRQHandler(void)
    { while(1){} }
    */

/*--- idiot detection ------------------------------------------------------------------*/

#if !defined(PROJECT_ENABLE_UART0)
    #error "uart0 should always be enabled and used for the UI. better be a good reason otherwise."
    /* uart0 is used by the LP */
#endif

// i fear for the day this happens
static_assert(pdTRUE == true,
        "pdTRUE != true . the FreeRTOS definition of \"true\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );
static_assert(pdFALSE == false,
        "pdFALSE != false . the FreeRTOS definition of \"false\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );

#ifdef MSPM0G3507_LQFP64
    #define MSPM0G3507_FOOTPRINT_C0 1
#else
    #define MSPM0G3507_FOOTPRINT_C0 0
#endif
#ifdef MSPM0G3507_LQFP48
    #define MSPM0G3507_FOOTPRINT_C1 1
#else
    #define MSPM0G3507_FOOTPRINT_C1 0
#endif
#ifdef MSPM0G3507_VQFN48
    #define MSPM0G3507_FOOTPRINT_C2 1
#else
    #define MSPM0G3507_FOOTPRINT_C2 0
#endif
#ifdef MSPM0G3507_VQFN32
    #define MSPM0G3507_FOOTPRINT_C3 1
#else
    #define MSPM0G3507_FOOTPRINT_C3 0
#endif
#ifdef MSPM0G3507_VSSOP28
    #define MSPM0G3507_FOOTPRINT_C4 1
#else
    #define MSPM0G3507_FOOTPRINT_C4 0
#endif
// Total number of footprints selected
#define MSPM0G3507_FOOTPRINT_TOTAL ( \
    MSPM0G3507_FOOTPRINT_C0 + \
    MSPM0G3507_FOOTPRINT_C1 + \
    MSPM0G3507_FOOTPRINT_C2 + \
    MSPM0G3507_FOOTPRINT_C3 + \
    MSPM0G3507_FOOTPRINT_C4 )
#if MSPM0G3507_FOOTPRINT_TOTAL == 0
    #error "No MSPM0G3507 variant defined. Must define exactly one."
#elif MSPM0G3507_FOOTPRINT_TOTAL > 1
    #error "Multiple MSPM0G3507 variants defined. Can only define one."
    // macros are at top of the header file
#endif
